tests/org.jboss.tools.bpel.ui.bot.test/messages/BluePrint3/BluePrint3_response_3.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
   <env:Header/>
   <env:Body>
      <pur:purchaseOrder xmlns:pur="http://manufacturing.org/xsd/purchase">
         <pur:orderId>123</pur:orderId>
         <pur:customerId>456</pur:customerId>
         <pur:orderDescription>OrderValid: Purchase an item that is in stock</pur:orderDescription>
         <pur:price>49.98</pur:price>
      </pur:purchaseOrder>
   </env:Body>
</env:Envelope>